app/controllers/welcome_controller.rb

  def index

  	@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]